# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import numpy as np 
import pandas as pd

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
# your code here

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [2]:
employees = pd.read_csv('Employee.csv')

#### Explore the data types of the `employees` dataframe. Comment your results.

In [4]:
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
There are 7 columns which describe
- Nominal; Gender, Department, Name
- Ordinal; Education, Title
- Ratio; Years, Salary
Stuff. 
"""

#### What's the average salary in this company?

In [7]:
employees['Salary'].mean()

48.888888888888886

#### What's the highest salary?

In [8]:
employees['Salary'].max()

70

#### What's the lowest salary?

In [9]:
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [12]:
employees.min()

Name               Ana
Department          HR
Education     Bachelor
Gender               F
Title               VP
Years                1
Salary              30
dtype: object

#### Find all the information about an employee called David.

In [27]:
employees.where(employees['Name'] == 'David')

    Name Department Education Gender    Title  Years  Salary
0    NaN        NaN       NaN    NaN      NaN    NaN     NaN
1    NaN        NaN       NaN    NaN      NaN    NaN     NaN
2  David         HR    Master      M  analyst    2.0    30.0
3    NaN        NaN       NaN    NaN      NaN    NaN     NaN
4    NaN        NaN       NaN    NaN      NaN    NaN     NaN
5    NaN        NaN       NaN    NaN      NaN    NaN     NaN
6    NaN        NaN       NaN    NaN      NaN    NaN     NaN
7    NaN        NaN       NaN    NaN      NaN    NaN     NaN
8    NaN        NaN       NaN    NaN      NaN    NaN     NaN

#### Could you return only David's salary?

In [28]:
employees['Salary'].where(employees['Name'] == 'David')

0     NaN
1     NaN
2    30.0
3     NaN
4     NaN
5     NaN
6     NaN
7     NaN
8     NaN
Name: Salary, dtype: float64

#### Print all the rows where job title is associate.

In [29]:
employees.where(employees['Title'] == 'associate')

     Name Department Education Gender      Title  Years  Salary
0     NaN        NaN       NaN    NaN        NaN    NaN     NaN
1     NaN        NaN       NaN    NaN        NaN    NaN     NaN
2     NaN        NaN       NaN    NaN        NaN    NaN     NaN
3     NaN        NaN       NaN    NaN        NaN    NaN     NaN
4  Samuel      Sales    Master      M  associate    3.0    55.0
5     Eva      Sales  Bachelor      F  associate    2.0    55.0
6     NaN        NaN       NaN    NaN        NaN    NaN     NaN
7   Pedro         IT       Phd      M  associate    7.0    60.0
8     NaN        NaN       NaN    NaN        NaN    NaN     NaN

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [30]:
# Method 1
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [31]:
# Method 2
print(employees.iloc[:3])

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [49]:
employees[(employees['Salary'] > 55) & (employees['Title'] == 'associate')]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [51]:
employees.groupby(['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [52]:
employees.groupby(['Title']).mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [42]:
print('Q1',employees['Salary'].quantile(0.25))
print('Q2',employees['Salary'].quantile(0.5))
print('Q3',employees['Salary'].quantile(0.75))

Q1 35.0
Q2 55.0
Q3 60.0

#### Is the mean salary different per gender?

In [53]:
employees.groupby(['Gender']).mean()

##yes it is!

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [39]:
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

TypeError: unsupported operand type(s) for -: 'str' and 'str'

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here